# Dataframe

#### Empezaremos con la importación de las librerias pandas y numpy con los nombres (pd,np)

In [3]:
import numpy as np
import pandas as pd

#### Creación de un DataFrame a partir de un diccionario

In [4]:
d = {'col1' : pd.Series([1,2,3,4]),
     'col2' : pd.Series([4,3,2,1])}
df = pd.DataFrame(d)
df

   col1  col2
0     1     4
1     2     3
2     3     2
3     4     1

#### Obtención de datos de un DataFrame

In [5]:
df['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [6]:
type(df['col1'])

pandas.core.series.Series

##### Como se puede ver encima poniendo el nombre de una key nos devolverá una Series con todos sus valores

#### Creación de una columna con sumas

In [7]:
df['col4'] = df['col1']+df['col2']
df

   col1  col2  col4
0     1     4     5
1     2     3     5
2     3     2     5
3     4     1     5

#### Borrado de una columna

In [9]:
del df['col4']
df

   col1  col2
0     1     4
1     2     3
2     3     2
3     4     1

#### Añadido de una columna con insert

In [13]:
#df.insert(0,'col0',df['col1']+df['col2'])
df

   col0  col1  col2
0     5     1     4
1     5     2     3
2     5     3     2
3     5     4     1

#### Rellenado de una columna con un valor

In [15]:
#df = df.assign(col3=3)
df

   col0  col1  col2  col3
0     5     1     4     3
1     5     2     3     3
2     5     3     2     3
3     5     4     1     3